#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.create_S3_bucket.aws_s3_bucket.bucket1: Refreshing state... [id=learning-dev-grahamwright.net]
aws_iam_role.batch_role: Refreshing state... [id=batch_role]
aws_security_group.batch_security_group: Refreshing state... [id=sg-05f28f03e0bcde8aa]
aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=batch_role-20220405015944530800000001]
aws_s3_object.lambda_hello_world: Refreshing state... [id=hello-world.zip]
module.create_S3_bucket.aws_s3_bucket_acl.bucket1: Refreshing state... [id=learning-dev-grahamwright.net,private]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_s3_object.lambda_hello_world has changed
  ~ resource "aws_s3_object" "lambda_hello_world" {
        id                 = "hello-world.zip"
      + metadata           = {}
      + tags               = {}
        # (10 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.hello_world will be created
  + resource "aws_cloudwatch_log_group" "hello_world" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/HelloWorld"
      + retention_in_days = 30
      + tags_all          = (known after apply)
    }

  # aws_iam_role.lambda_exec will be created
  + resource "aws_iam_role" "lambda_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "serverless_lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.lambda_policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "serverless_lambda"
    }

  # aws_lambda_function.hello_world will be created
  + resource "aws_lambda_function" "hello_world" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "HelloWorld"
      + handler                        = "hello.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs12.x"
      + s3_bucket                      = "learning-dev-grahamwright.net"
      + s3_key                         = "hello-world.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "ZTigJ3I3xUCNSDdmt7vhVoTbTGxTTsCD8qC+8niAhSI="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Warning: Deprecated Resource

  with data.aws_subnet_ids.all_default_subnets,
  on main.tf line 29, in data "aws_subnet_ids" "all_default_subnets":
  29: data "aws_subnet_ids" "all_default_subnets" {

The aws_subnet_ids data source has been deprecated and will be removed in a
future version. Use the aws_subnets data source instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @gwright99, Action: `pull_request`, Working Directory: ``, Workflow: `Deploy Infrastructure With TF`*